var mmseg = require("../index.js");
var q = mmseg.open('/usr/local/etc/');

var length=0;

var str="this is english test 收2拾4心333情，将这一段时间所经历的一些事情和从杀戮本源魂珠那里得来的消息都整理了一遍，然后，龙翔就站起身来，准备带着小白开始他们增强实力之旅。  当然，在离开之前，龙翔还是没有忘记将这个亚龙魔兽身体里面的那颗魔核取出来。  这一颗散发着一股荧光魔核足足有鸡蛋大小，照这样看来，这一颗魔核里面的能量就足够小白和龙翔补充能量十多次了。  将魔核收进空间戒指之后，龙翔就抱着小白起身继续向前走去。  按照杀戮本源魂珠所说的，龙翔现在前进的方向上面就有一片森林，穿过森林之后，就可以达到一座副城。  正好，在穿过这一片森林的时候，会遇到各种各样的魔兽和人类冒险者，在这一段时间会有足够多的机会锻炼龙翔和小白的实战经验。  按照杀戮本源魂珠所说的，遇到魔兽，最好就由小白出手，而碰到人类武者的话，就由龙翔出手，只有碰到在一个人对付不了的对手的时候，才两个人一块出手。  这样也算是事先演练一下，熟悉之后对手的战斗风格。  然后，杀戮本源魂珠还补充了一点，在前期战斗的时候，小白先不要使用自己血脉之中的威压，遇到的敌人的时候再使用。  这些，龙翔和小白都赞成，认为这样对两人的实力增长有很大的帮助。但是，随后杀戮本源魂珠所说的，龙翔和小白就有些不太同意了。  杀戮本源魂珠告诉小白和龙翔，在前进的道路上面，不管遇到什么样的生命，最好不要和他交谈，也不要相信任何人说的任何话。要么离得远远地，要么就不由分说的上前厮杀。遇见看似不平的事情，更加不要拔刀相助。  对于这一点，龙翔和小白一致认为，这是因为杀戮本源魂珠本性之中不可磨灭的杀戮欲望在作祟。根本就没有什么实质性的理由和意义。  一路上，龙翔和小白时刻放出自己的灵魂力量，感知着周围的一举一动，在这危机四伏的空间里面，由不得他们不小心谨慎。  不过，与此同时，杀戮本源魂珠也不断的向龙翔和小白传达一些他不断记起的信息。  按照杀戮本源魂珠告诉他们的方法，小白和龙翔总算是学会了修罗炼狱场的计时方法。  在他们出发的时候，正是星期三刚刚开始的时候，但是，现在，一直到了第二个星期一，也就是足足经过了五天的时间，龙翔和小白还是没有碰到一个生命。  这不禁让他们感觉到烦躁，对于他们来说，连续五天枯燥的赶路，实在是一件令人难受的事情。  在星期一过了大约一半的时候，终于，一望无际的荒原走到了尽头，远远的，小白和龙翔已经能够看到一片森林的轮廓了。  这个发现，让小白和龙翔一阵激动和兴奋。不管怎样，眼前一成不变的环境变化一下也算是好事。更何况，按照杀戮本源魂珠所说的，在森林里面，不管是人类冒险者还是魔兽，数量和密集程度都要较荒原上面高出很多倍。  终于，又是三个小时快速的赶路，小白和龙翔终于到了森林的边缘。  就在龙翔和小白准备进去森林里面的时候，突然冲出来了一个人。  这是一个中年人，这个人看起来相当的狼狈，浑身上下所有的衣服都成了一条条的碎布条挂在身上，根本就遮不住多少地方。  从那些裸露在外的地方，龙翔可以看见一道道狰狞的伤口，有些伤口上面的鲜血甚至还在飞快的往外面冒。  一看就知道，这个中年人在不久之前一定经历了一场相当残酷的战斗。  这个中年人飞快的向龙翔和小白所在的地方跑过来，随着这个中年人的靠近，一股浓郁的药味冲进龙翔和小白的鼻子之中。  看着这个中年人直接朝着自己冲过来，似乎根本就没有发现自己一样，龙翔眉头不禁皱了皱，脚下一个滑步，侧身让开。  而这时，那个中年人好像突然发现了龙翔的存在，眼睛一亮，叫道：“朋友，快逃吧！”  龙翔仔细的感受了一下，发现那个中年人仅仅是五阶武爵，但是，在这个中年人的双眼上面并不是想之前碰到的那些魔兽一样双眼通红的，只是在眼底深处有着一抹猩红。  这样的现象杀戮本源魂珠早就告诉过龙翔，这是因为服用要玩之后出现的症状。  听到这个中年人的话，龙翔不但没有立刻离开，反而还拦在了那个中年人的面前。  “你，你这究竟是什么意思？”看到龙翔拦在自己面前，那个中年人不禁有些急怒的说道。  “没什么意思，只是想要问一下，在前面究竟有什么样的危险。”听到这个中年人的责问，龙翔只是淡淡的一笑。  “我好心提醒你，到现在你居然害我，你想死的话我不拦着你，但是，你也不要拉着我陪你一块去死。”听到龙翔的话，那个中年人恼怒的说道，说完就要从龙翔的身边走过去。  龙翔又是一个滑步，拦在了那个中年人的面前，这个中年人的话，严重的激起了龙翔的好奇心，现在，龙翔是铁了心弄明白究竟是什么一回事。  于是龙翔想着说道：“放心吧，你告诉我究竟是怎么一回事之后，我就放你离开。”  听到龙翔的话，那个中年人显然更加的愤怒了，但是，他的实力太低，打又打不过，想要从旁边绕过去，速度又没有龙翔快，只得恨恨的说道：“你想要知道，自己到前面去看看不就知道了，何必多此一举的来问我。”  龙翔淡淡的一笑，没有多说什么，只是身上的气势不断的攀升。  感受到龙翔身上恐怖的气势，那个中年人脸色有些发白，知道要是自己现在还这么磨蹭的话，这个年轻人说不定就会翻脸了。  所以只好老老实实的说道：“在前面，我和我的伙伴遇到了一只兽爵巅峰境界的风系魔兽，我们一行五个，到现在也仅仅只有我一个人活着逃出来了，快走吧，说不定那只魔兽就要追出来了。”  听到这话，龙翔眉头微不可察的皱了皱，这个人竟然扔下同伴一个人逃生，像这样的人，龙翔是最为不齿的。  厌恶的摆了摆手，龙翔冷冷的说道：“滚吧，竟然抛弃同伴一个人逃生，像你这样的人，应该第一个被魔兽吃掉。”  听到龙翔的话，那个中年人的眼中流落出一丝愤怒的神色，但是，随即又被很好的掩饰住了，低下头，默默的从龙翔的身边绕开。  看着这个中年人离开了，龙翔看了看身边的小白，笑道：“一个兽爵巅峰境界的魔兽？正好我们可以练一下手。好长时间都没有机会动手，机会终于来了。我们走吧，到前面看看去。”  说完，就准备带着小白向前走去。  这时，杀戮本源魂珠的声音传来：“你们真的准备到前面的森林里面看看？你们就真的相信这个中年人的话？”  听到杀戮本源魂珠的话，龙翔笑了笑，说道：“当然要看看，就算是前面没有魔兽，我们反正是要去森林里面的，至于那个人的话，相不相信，都不重要了。”  感受到龙翔话语中的坚定，杀戮本源魂珠没有多说什么。  然后龙翔就带着小白一起走进了森林里面。  在走进森林里面的时候，小白和龙翔就同时感觉到自己身上一阵发寒。就好像一个远古凶兽正大张着嘴等着自己自投罗网。  但是，现在两人都已经走进森林里面了，当然不可能再转身离开了。只得硬着头皮小心翼翼地向前面慢慢的前行着。  就这样，大约经过了一炷香的时间，小白和龙翔已经深入森林里面大约两千米了，在这一路上，走过的相当平静，森林里面没有看见任何动物，也没有听见任何声音。  在这样安静的有些过分的环境下，龙翔和小白都要随时紧绷着自己的神经，不敢有丝毫的大意。  就在这时，从四周传来一阵阵向枭啼一般的声音，听到这个声音，龙翔和小白出奇的，竟然不约而同的松了一口气。  实在是因为之前的那种过于平静的气氛太压抑了，现在听见这种平时听起来相当怪异和讨厌的声音，在这个时候，竟然还感觉到有一丝的悦耳。  在这一声枭啼之后，龙翔和小白面前就出现了一行五个冒险者打扮的武者，看到这些武者，龙翔和小白心中都是一惊，在他们面前的五个武者，身上散发出来的气息极为的隐晦，但是，从这丝丝隐晦的能量波动之中，龙翔和小白都能够清晰的感觉到，这五个武者，竟然无一例外的都是武皇境界的强者。  其中，有两名武者处在三阶武皇，剩下的三名都是一阶武皇。  看到这样强悍的阵容，龙翔和小白脸上都是不自觉的露出了一丝凝重的神色。  就算是在武印大陆上面，面对这样强悍的阵容，龙翔和小白都需要花费不小的力气才能够解决，在这个修罗炼狱场里面，同等级的武者，实力都要远远的超过武印大陆上面的武者。  看来，今天的这一仗实在是不好打，要是自己真的和一般的武爵境界的武者一样的话，今天真的是插翅难飞了，这分明就是事先预谋好的，这根本就是一个阴谋！  但是，面对这样的情况，龙翔丝毫不惧，他有着自己的底牌，虽然现在的形式看起来不太乐观，但是，这样的阵容，还无法将龙翔逼上绝路。  现在龙翔总算是想明白了事情的前因后果，也相信了杀戮本源魂珠所说的话。  在这个空间里面，根本就不应该相信任何人，这是一个没有丝毫信任感存在的空间。  想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。想起杀戮本源魂珠的话，龙翔的双眼不禁一亮，在这个根本就没有丝毫信任感存在的空间里面，现在竟然出现了五个人联手对付自己的情况。";

var start= +new Date();

var regNonChinese=/([\w])/;
function filterWords(arr){
	//unique, Chinese only
	var u = {}, a = [];
	for(var i = 0, l = arr.length; i < l; ++i){
		if(u.hasOwnProperty(arr[i]) || (arr[i].length< 2) || regNonChinese.test(arr[i])) {
			continue;
		}
		a.push(arr[i]);
		u[arr[i]] = 1;
	}
	return a;
}


function run () {
	length+= str.length;
	//var arr = q.segmentSync("13家店通用！9元超低价享404元维娜姿瘦身养生套餐:速效纤体排毒（原价298元30分钟）+美式头面部舒压疗法 原价58（约15分钟）+背部紧致修身（原价48元15分钟）+全身脂肪测评1次！男女通用！商家承诺绝无任何隐性消费！国际专业减重连锁，让身体回复轻盈呼吸！繁體測試測試");
//	var arr = q.segmentSync(str);
	var arr = q.complexSegmentSync(str);
	arr= filterWords(arr);

//	arr = mmseg.uniq(mmseg.clean(arr));
//	console.log(arr && arr.join(","));
}

function runGroup () {
	for (var i = 0; i < 1000; i++) {
		run();
	};
}

//setInterval( runGroup, 1000 );
//run();
runGroup();

var dur= +new Date - start;
console.log('finished, timecost: '+ dur + ' ms, text length : '+ length + ', speed: '+ (length*1000/dur)+ ' characters/second');

//run();
